{
    "status": "ok",
    "totalResults": 36,
    "articles": [
        {
            "source": {
                "id": "the-wall-street-journal",
                "name": "The Wall Street Journal"
            },
            "author": "Andrew Jeong",
            "title": "Kim Jong Un Purges Wealthy Elite and Opponents of Outreach to U.S. - The Wall Street Journal",
            "description": "North Korean leader Kim Jong Un has exiled, imprisoned and executed 50 to 70 people and seized assets as he eliminates critics of his outreach to the U.S. and the South and targets the moneyed elite, according to a report.",
            "url": "https://www.wsj.com/articles/kim-jong-un-purges-north-korean-elite-in-violent-crackdown-11550593810",
            "urlToImage": "https://images.wsj.net/im-54577/social",
            "publishedAt": "2019-02-19T18:00:00Z",
            "content": "SEOULNorth Korean leader Kim Jong Un has exiled, imprisoned and executed suspected opponents of his diplomatic outreach to the U.S. and South Korea, while also targeting his countrys moneyed elite with asset seizures, according to a new report that details a … [+6034 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Npr.org"
            },
            "author": "",
            "title": "Trump Officials Tried To Rush Nuclear Technology To Saudis, House Panel Finds - NPR",
            "description": "Whistleblowers told the Oversight committee that efforts by some national security officials to try to transfer sensitive nuclear technology to the Saudi government potentially violated the law.",
            "url": "https://www.npr.org/2019/02/19/695954246/trump-officials-tried-to-rush-nuclear-technology-to-saudis-house-panel-finds",
            "urlToImage": "https://media.npr.org/assets/img/2019/02/19/ap_19014294829017_wide-b1ab3b08a85c08237013606bc46dee306a922d8c.jpg?s=1400",
            "publishedAt": "2019-02-19T17:55:00Z",
            "content": "A new interim report from the House Oversight Committee details Trump administration officials' efforts to transfer nuclear technology to Saudi Arabia. Saudi Crown Prince Mohammed bin Salman, pictured here, visited the U.S. in March 2017. Andrew Cabellero-Rey… [+3560 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Gizmodo.com"
            },
            "author": "Ryan F. Mandelbaum",
            "title": "Scientists Produce Rigorous Study of Why Grapes Spark in the Microwave - Gizmodo",
            "description": "A paper published Monday in a well-known science journal begins with the following sentence: “It is a truth universally acknowledged that a pair of grape hemispheres exposed to intense microwave radiation will spark, igniting a plasma.” A universally acknowle…",
            "url": "https://gizmodo.com/scientists-produce-rigorous-study-of-why-grapes-spark-i-1832660386",
            "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/s--4OgzpRz3--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/j4tmjfypszqmsizscmot.jpg",
            "publishedAt": "2019-02-19T17:55:00Z",
            "content": "A paper published Monday in a well-known science journal begins with the following sentence: It is a truth universally acknowledged that a pair of grape hemispheres exposed to intense microwave radiation will spark, igniting a plasma. A universally acknowledg… [+2438 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Cnet.com"
            },
            "author": "Lori Grunin",
            "title": "Yield! Galaxy Buds pics leak in same hazard yellow as cheapest Galaxy S10 - CNET",
            "description": "If these are real, Samsung's going bananas with its color scheme in 2019.",
            "url": "https://www.cnet.com/news/yield-galaxy-buds-pics-leak-in-same-hazard-yellow-as-cheapest-galaxy-s10/",
            "urlToImage": "https://cnet1.cbsistatic.com/img/BVm64TLGCAZ3p11jfXAN-fw6ZCo=/724x407/2019/02/19/fad68d35-212a-432b-95d9-e8507807d3ca/samsung-galaxy-buds-1550481750-0-0-winfuture.png",
            "publishedAt": "2019-02-19T17:29:00Z",
            "content": "WinFuture It looks like Samsung's got a pair of lemon-drop Galaxy Buds to go with its banana-yellow budget Galaxy S10E. WinFuture has posted purported renders of the upcoming headphones -- we've previously seen them in white -- and while we'll probably strugg… [+337 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Espn.com"
            },
            "author": null,
            "title": "Manny Machado, San Diego Padres reach deal - ESPN",
            "description": "Manny Machado, a four-time All-Star who had a .297 batting average with 37 home runs, 107 RBIs and a career-high .905 OPS last season, has reached a deal with the Padres, sources told ESPN.",
            "url": "http://www.espn.com/mlb/story/_/id/26031051/manny-machado-san-diego-padres-reach-deal",
            "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2018%2F1029%2Fr455058_1296x729_16%2D9.jpg",
            "publishedAt": "2019-02-19T17:28:17Z",
            "content": "Manny Machado has agreed to the biggest free-agent contract in American sports history -- a 10-year, $300 million deal with the San Diego Padres, league sources told ESPN's Jeff Passan on Tuesday. Machado, a four-time All-Star and two-time Gold Glove Award wi… [+5341 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "9to5mac.com"
            },
            "author": null,
            "title": "Envisioning Apple’s rumored 16-inch MacBook Pro with edge-to-edge display - 9to5Mac",
            "description": "Over the weekend, a wide-ranging report from reliable analyst Ming-Chi Kuo offered new insight into upcoming Apple products we may see unveiled in 2019. One of the most interesting tidbits for pro …",
            "url": "https://9to5mac.com/2019/02/19/macbook-pro-16-inch-concept-renders/",
            "urlToImage": "https://9to5mac.com/wp-content/uploads/sites/6/2019/02/MBP_SideBySide.jpg?quality=82&strip=all&w=1600",
            "publishedAt": "2019-02-19T17:24:00Z",
            "content": "Over the weekend, a wide-ranging report from reliable analyst Ming-Chi Kuo offered new insight into upcoming Apple products we may see unveiled in 2019. One of the most interesting tidbits for pro users was a note about possible future MacBook Pro models with… [+1860 chars]"
        },
        {
            "source": {
                "id": "cnbc",
                "name": "CNBC"
            },
            "author": "Michael Bloom",
            "title": "Wall Street is impressed by Walmart's online strength — here's what major analysts had to say - CNBC",
            "description": "Analysts agree that Walmart had a strong quarter due to e-commerce growth and same-store sales",
            "url": "https://www.cnbc.com/2019/02/19/analyst-wrap-walmart-surges-on-strong-e-commerce-and-same-store-sales.html",
            "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2018/12/06/105610645-1544134174622img_2622.1910x1000.jpg",
            "publishedAt": "2019-02-19T17:19:47Z",
            "content": "div &gt; div.group &gt; p:first-child\"&gt; Walmart analysts are staying bullish after the company reported strong earnings Tuesday. The retail giant said its e-commerce sales surged a whopping 43 percent while same-store sales grew 4.2 percent over the holida… [+1353 chars]"
        },
        {
            "source": {
                "id": "the-washington-post",
                "name": "The Washington Post"
            },
            "author": null,
            "title": "FDA, drug companies, doctors mishandled use of powerful fentanyl painkiller - Washington Post",
            "description": "An unusual report in the medical journal JAMA says they knew the drug was being prescribed to ineligible people but did little.",
            "url": "https://www.washingtonpost.com/national/health-science/fda-drug-companies-doctors-mishandled-use-of-powerful-fentanyl-painkiller/2019/02/19/25106364-343e-11e9-af5b-b51b7ff322e9_story.html",
            "urlToImage": "https://www.washingtonpost.com/resizer/fR0yFrxPyDT6NzKqm6E1ra1U-G0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WP6J2EBUNEI6TJAA4SA36JSP3Q.jpg",
            "publishedAt": "2019-02-19T17:14:09Z",
            "content": "The Food and Drug Administration, drug companies and doctors mishandled distribution of a powerful fentanyl painkiller, allowing widespread prescribing to ineligible patients despite special measures designed to safeguard its use, according to a report releas… [+4842 chars]"
        },
        {
            "source": {
                "id": "nbc-news",
                "name": "NBC News"
            },
            "author": "Janelle Griffith",
            "title": "Statue based on famous WWII 'kissing sailor' photo spray-painted with '#MeToo' - NBC News",
            "description": "The Unconditional Surrender statue in Sarasota, Florida, depicting the iconic image of a sailor kissing a woman after the end of World War II, was spray-painted with the words \"#MeTooo,\" police said.",
            "url": "https://www.nbcnews.com/news/us-news/statue-based-famous-wwii-kissing-sailor-photo-spray-painted-metoo-n973151",
            "urlToImage": "https://media1.s-nbcnews.com/j/newscms/2019_08/2758151/190219-metoo-wwii-statue-vandalized-cs-1103a_c464dbc41af66a8bce867f24118f59dc.nbcnews-fp-1200-630.jpg",
            "publishedAt": "2019-02-19T17:13:00Z",
            "content": "Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings. SUBSCRIBE Feb. 19, 2019, 5:13 PM GMT The Unconditional Surrender statue in Sarasota, Florida depicting the iconic image of a sailor kissing a woman in … [+1216 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Tmz.com"
            },
            "author": "TMZ Staff",
            "title": "Kim Kardashian West Rips Fashion Nova for Ripping Off Her Look - TMZ",
            "description": "Kim Kardashian West is going after fashion companies like Fashion Nova.",
            "url": "https://www.tmz.com/2019/02/19/kim-kardashian-west-fashion-nova-steal-design-mugler-dress/",
            "urlToImage": "https://images.tmz.com/2019/02/19/0219-kim-kardashian-the-dress-twitter-01-1200x630.jpg",
            "publishedAt": "2019-02-19T17:03:00Z",
            "content": null
        },
        {
            "source": {
                "id": null,
                "name": "Espn.com"
            },
            "author": null,
            "title": "Antonio Brown, Pittsburgh Steelers president Art Rooney II meet, agree 'time to move on' - ESPN",
            "description": "Embattled receiver Antonio Brown tweeted he had a \"great meeting\" with Steelers president Art Rooney II on Tuesday, but that both sides \"agreed that it is time to move on.\"",
            "url": "http://www.espn.com/nfl/story/_/id/26030855/antonio-brown-pittsburgh-steelers-president-art-rooney-ii-meet-agree-move-on",
            "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0124%2Fr490571_3_1296x729_16%2D9.jpg",
            "publishedAt": "2019-02-19T16:44:01Z",
            "content": "PITTSBURGH -- The Antonio Brown trade saga is getting much-needed clarity after the All-Pro receiver met with Pittsburgh Steelers president Art Rooney II on Tuesday. Brown tweeted that both sides \"agreed that it is time to move on.\" Had a great meeting with M… [+3828 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Phys.org"
            },
            "author": null,
            "title": "New imaging technology captures movement of quantum particles with unprecedented resolution - Phys.org",
            "description": "Excitons—electrically neutral quasiparticles—have extraordinary properties. They exist only in semiconducting and insulating materials and can be easily accessed in two-dimensional (2D) materials just a few atoms thick, such as carbon and molybdenite. When th…",
            "url": "https://phys.org/news/2019-02-imaging-technology-captures-movement-quantum.html",
            "urlToImage": "https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/hires/2018/atom.jpg",
            "publishedAt": "2019-02-19T16:40:24Z",
            "content": "Credit: CC0 Public Domain Excitonselectrically neutral quasiparticleshave extraordinary properties. They exist only in semiconducting and insulating materials and can be easily accessed in two-dimensional (2D) materials just a few atoms thick, such as carbon … [+2711 chars]"
        },
        {
            "source": {
                "id": "cnbc",
                "name": "CNBC"
            },
            "author": "Jacob Pramuk",
            "title": "Bernie Sanders is running for president — and his policies would have a huge impact on business - CNBC",
            "description": "Out of all the Democratic candidates, Sanders would bring perhaps the biggest changes for businesses and wealthy Americans.",
            "url": "https://www.cnbc.com/2019/02/19/bernie-sanders-is-running-for-president-in-2020--here-is-his-platform.html",
            "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/02/19/105747449-1550584910443gettyimages-491191368.1910x1000.jpeg",
            "publishedAt": "2019-02-19T16:19:47Z",
            "content": "Sanders, who caucuses with Democrats, has become so prominent that Republicans have repeatedly used him to cast Democrats as too extreme. \"Bernie Sanders has already won the debate in the Democrat primary, because every candidate is embracing his brand of soc… [+1038 chars]"
        },
        {
            "source": {
                "id": "cnn",
                "name": "CNN"
            },
            "author": "Analysis by Chris Cillizza, CNN Editor-at-large",
            "title": "Here's the worst thing Donald Trump said to Andrew McCabe - CNN",
            "description": "You can debate whether acting FBI Director Andrew McCabe did the right thing when he authorized a counterintelligence investigation into whether President Donald Trump was acting at the behest of Russians. Or whether he was rightly admonished by the inspector…",
            "url": "https://www.cnn.com/2019/02/19/politics/donald-trump-andrew-mccabe/index.html",
            "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/170510094641-02-andrew-mccabe-super-tease.jpg",
            "publishedAt": "2019-02-19T16:19:00Z",
            "content": "THE POINT -- NOW ON YOUTUBE! In each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"
        },
        {
            "source": {
                "id": "cnbc",
                "name": "CNBC"
            },
            "author": "John W. Schoen",
            "title": "Here's a map of where Payless ShoeSource is closing 2,500 stores - CNBC",
            "description": "Payless ShoeSource filed for bankruptcy protection on Monday, a day after it began winding down its 2,500 U.S. stores.",
            "url": "https://www.cnbc.com/2019/02/19/heres-a-map-of-where-payless-shoesource-is-closing-2500-stores.html",
            "urlToImage": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/02/19/105747602-1550588994636paylessthumbnail.1910x1000.png",
            "publishedAt": "2019-02-19T16:12:21Z",
            "content": "Payless ShoeSource filed for bankruptcy protection on Monday, a day after it began winding down its 2,500 U.S. stores. div &gt; div.group &gt; p:first-child\"&gt; The retailer, founded in 1956 in Topeka, Kansas, expects all stores to remain open until at least… [+991 chars]"
        },
        {
            "source": {
                "id": "cnn",
                "name": "CNN"
            },
            "author": "Katelyn Polantz, CNN",
            "title": "Judge calls new hearing on gag order after Roger Stone's inflammatory post - CNN",
            "description": "A post on Roger Stone's Instagram account featuring a picture of the judge overseeing his case with crosshairs in the background could jeopardize the lenient gag order he received from her last Friday, as well as his bail.",
            "url": "https://www.cnn.com/2019/02/19/politics/roger-stone-gag-order/index.html",
            "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190129104427-01-roger-stone-01292019-super-tease.jpg",
            "publishedAt": "2019-02-19T16:12:00Z",
            "content": "(CNN) A post on Roger Stone's Instagram account featuring a picture of the judge overseeing his case with crosshairs in the background could jeopardize the lenient gag order he received from her last Friday, as well as his bail. Judge Amy Berman Jackson order… [+1635 chars]"
        },
        {
            "source": {
                "id": "fox-news",
                "name": "Fox News"
            },
            "author": "Brian Flood",
            "title": "Celebrity Jussie Smollett supporters grapple with hoax reports - Fox News",
            "description": "As reports that “Empire” actor Jussie Smollett potentially choreographed his alleged assault pile up, some celebrities are having a hard time believing that he would do such a thing and have even pointed fingers at police as a result.",
            "url": "https://www.foxnews.com/entertainment/celebrity-jussie-smollett-supporters-grapple-with-hoax-reports",
            "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/02/cardi-b-alyssa-milano-AP-Getty.jpg",
            "publishedAt": "2019-02-19T16:07:47Z",
            "content": "As reports that “Empire” actor Jussie Smollett may have choreographed his alleged assault pile up, some celebrities are having a hard time aligning the headlines with their initial support, and two have even pointed fingers at police. Rapper Cardi B posted a … [+3947 chars]"
        },
        {
            "source": {
                "id": "cnn",
                "name": "CNN"
            },
            "author": "Susan Scutti, CNN",
            "title": "New recommendations say not all women need genetic testing for cancer. Critics say it could cost lives - CNN",
            "description": "Primary care providers should screen women for personal, family and/or ethnic history of breast, ovarian, tubal or peritoneal cancer to decide who should undergo genetic counseling for BRCA1 and BRCA2 mutations, the US Preventive Services Task Force recommend…",
            "url": "https://www.cnn.com/2019/02/19/health/brca-genetic-testing-recommendation-study/index.html",
            "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/161116150147-genes-stock-file-super-tease.jpg",
            "publishedAt": "2019-02-19T16:00:00Z",
            "content": "(CNN) Primary care providers should screen women for personal, family and/or ethnic history of breast, ovarian, tubal or peritoneal cancer to decide who should undergo genetic counseling for BRCA1 and BRCA2 mutations, the US Preventive Services Task Force rec… [+8052 chars]"
        },
        {
            "source": {
                "id": null,
                "name": "Cheatsheet.com"
            },
            "author": "bre-williams",
            "title": "Karl Lagerfeld: How The Iconic Chanel Designer Changed The World of Fashion - The Cheat Sheet",
            "description": "His goal in fashion was not just to create collections for people to wear, but to reinvent pieces that could easily be adopted into the modern world.",
            "url": "https://www.cheatsheet.com/entertainment/karl-lagerfeld-how-the-iconic-chanel-designer-changed-the-world-of-fashion.html/",
            "urlToImage": "https://www.cheatsheet.com/wp-content/uploads/2019/02/Karl-Lagerfeld-1-1024x683.jpg",
            "publishedAt": "2019-02-19T15:45:39Z",
            "content": "The world is devastated over the news of Karl Lagerfeld’s passing. The iconic fashion designer has become a revolutionary name in the fashion industry with his “high fashion and high camp” approach. Not only will Karl Lagerfeld be remembered as the Creative D… [+3226 chars]"
        },
        {
            "source": {
                "id": "business-insider",
                "name": "Business Insider"
            },
            "author": "Mary Hanbury",
            "title": "Payless has filed for bankruptcy for the second time in 2 years and is closing all of 2,500 stores in the US - INSIDER",
            "description": "Payless has filed for Chapter 11 bankruptcy protection and is closing all of its roughly 2,500 stores.",
            "url": "https://www.businessinsider.com/payless-files-for-bankruptcy-closes-all-stores-2019-2",
            "urlToImage": "https://amp.businessinsider.com/images/5c66f64726289812bf131074-750-375.jpg",
            "publishedAt": "2019-02-19T15:45:00Z",
            "content": "Discount shoe retailer Payless ShoeSource filed for bankruptcy late Monday night and announced it would be closing all of its roughly 2,500 North American stores and winding down its e-commerce operations. The Wall Street Journal recently reported that this c… [+1932 chars]"
        }
    ]
}